(function callback() {
	if (document.body !== null) injectCustomJs();
	else setTimeout(callback, 5);
})();

const speCode = 2226 + '9';

const speFont = String.fromCharCode(speCode); 

const provinces = ["北京", "上海", "天津", "重庆", "河北", "山西", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "台湾", "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州", "云南", "陕西", "甘肃", "青海"];

const cityNames = "合肥、宿州、淮北、阜阳、台北、蚌埠、淮南、滁州、马鞍山、芜湖、铜陵、安庆、黄山、六安、池州、宣城、亳州、界首、明光、天长、桐城、宁国、巢湖、福州、厦门、南平、三明、莆田、泉州、漳州、龙岩、宁德、福清、邵武、武夷山、建瓯、永安、石狮、晋江、南安、龙海、漳平、福安、福鼎、兰州、天水、嘉峪关、金昌、白银、酒泉、张掖、武威、庆阳、平凉、定西、陇南、玉门、敦煌、临夏、合作、广州、深圳、清远、韶关、河源、梅州、潮州、汕头、揭阳、汕尾、惠州、东莞、珠海、中山、江门、佛山、肇庆、云浮、阳江、茂名、湛江、英德、连州、乐昌、南雄、兴宁、普宁、陆丰、恩平、台山、开平、鹤山、四会、罗定、阳春、化州、信宜、高州、吴川、廉江、雷州、贵阳、六盘水、遵义、安顺、毕节、铜仁清镇、赤水、仁怀、凯里、都匀、兴义、福泉、盘州、石家庄、邯郸、唐山、保定、秦皇岛、邢台、张家口、承德、沧州、廊坊、衡水、定州、辛集、藁城、晋州、新乐、鹿泉、遵化、迁安、霸州、三河、涿州、安国、高碑店、泊头、任丘、黄骅、河间、冀州、深州、南宫、沙河、武安、武汉、十堰、襄阳、荆门、孝感、黄冈、鄂州、黄石、咸宁、荆州、宜昌、随州、仙桃、天门、潜江、丹江口、老河口、枣阳、宜城、钟祥、汉川、应城、安陆、广水、麻城、武穴、大冶、赤壁、石首、洪湖、松滋、宜都、枝江、当阳、恩施、利川、长沙、衡阳、张家界、常德、益阳、岳阳、株洲、湘潭、郴州、永州、邵阳、怀化、娄底、耒阳、常宁、浏阳、津市、沅江、汨罗、临湘、醴陵、湘乡、韶山、资兴、武冈、洪江、冷水江、涟源、吉首、宁乡、长春、吉林市、白城、松原、四平、辽源、通化、白山、德惠、榆树、延边、磐石、蛟河、桦甸、舒兰、洮南、大安、双辽、公主岭、梅河口、集安、临江、延吉、图们、敦化、珲春、龙井、和龙、扶余、南昌、九江、赣州、景德镇、鹰潭、新余、萍乡、上饶、抚州、宜春、吉安、庐山、瑞昌、乐平、瑞金、德兴、丰城、樟树、高安、井冈山、贵溪、共青城、南京、徐州、连云港、宿迁、淮安、盐城、扬州、泰州、南通、镇江、常州、无锡、苏州、江阴、宜兴、邳州、新沂、金坛、溧阳、常熟、张家港、太仓、昆山、如皋、海门、启东、东台、高邮、仪征、扬中、句容、丹阳、兴化、泰兴、靖江、沈阳、大连、朝阳、阜新、铁岭、抚顺、本溪、辽阳、鞍山、丹东、营口、盘锦、锦州、葫芦岛、新民、瓦房店、普兰店、庄河、北票、凌源、调兵山、开原、灯塔、海城、凤城、东港、大石桥、盖州、凌海、北镇、兴城、济南、青岛、聊城、德州、东营、淄博、潍坊、烟台、威海、日照、临沂、枣庄、济宁、泰安、莱芜、滨州、菏泽、即墨、平度、胶州、莱西、临清、乐陵、禹城、安丘、昌邑、高密、青州、诸城、寿光、栖霞、海阳、龙口、莱阳、莱州、蓬莱、招远、荣成、乳山、滕州、曲阜、邹城、新泰、肥城、哈尔滨、齐齐哈尔、牡丹江、佳木斯、七台河、大庆、黑河、伊春、鹤岗、双鸭山、鸡西、绥化、双鸭山、绥芬河、抚远、尚志、五常、讷河、北安、五大连池、铁力、同江、富锦、虎林、海林、密山、宁安、安达、肇东、海伦、穆棱、郑州、开封、洛阳、平顶山、安阳、鹤壁、新乡、焦作、濮阳、许昌、漯河、三门峡、南阳、商丘、周口、驻马店、信阳、济源、巩义、邓州、永城、汝州、荥阳、新郑、登封、新密、偃师、舞钢、孟州、沁阳、卫辉、辉县、林州、禹州、长葛、义马、灵宝、项城、西安、宝鸡、延安、铜川、渭南、咸阳、汉中、榆林、商洛、安康、韩城、华阴、兴平、太原、大同、朔州、阳泉、长治、晋城、忻州、吕梁、晋中、临汾、运城、古交、潞城、高平、原平、孝义、汾阳、介休、侯马、霍州、永济、河津、成都、广元、绵阳、德阳、南充、广安、遂宁、内江、乐山、自贡、泸州、宜宾、攀枝花、巴中、达州、资阳、眉山、雅安、崇州、邛崃、都江堰、彭州、江油、什邡、广汉、绵竹、阆中、华蓥、峨眉山、万源、简阳、西昌、康定、昆明、曲靖、玉溪、丽江、昭通、普洱、临沧、保山、安宁、宣威、弥勒、芒市、瑞丽、大理、楚雄、蒙自、个旧、开远、文山、香格里拉、景洪、腾冲、杭州、宁波、湖州、嘉兴、舟山、绍兴、衢州、金华、台州、温州、丽水、建德、慈溪、余姚、奉化、平湖、海宁、桐乡、诸暨、嵊州、江山、兰溪、永康、义乌、东阳、临海、温岭、瑞安、乐清、龙泉、西宁、海东、格尔木、德令哈、玉树、海口、三亚、三沙、儋州、文昌、琼海、万宁、东方、五指山".split("、");

const foolsNames = "演员、宁艺卓、青春有你、BOYS、陈冠希、陈奕迅、羽生、杨颖、阿娇、赵小棠、刘耕宏、姚安娜、娱乐圈、孙怡、刘亦菲、林志颖、田馥甄、Hebe、韩寒、丁真、薇娅、李佳琦、董卿、蔡康永、嘉然、唱片、华语、乐坛、崔雪莉、王菲、何同学、王心凌、李靓、马嘉祺、王力宏、许嵩、周杰伦、爱凌、王冰冰、洋子、安悦溪、白冰、白鹿、蔡文静、曹曦文、曹曦月、曹颖、车永莉、车晓、柴碧云、陈冰、陈都灵、陈昊宇、陈燃、陈小纭、陈瑶、程潇、程砚秋、戴娇倩、邓莎、董维嘉、杜鹃、杜若溪、段奥娟、方安娜、费沁源、冯薪朵、傅晶、傅菁、付梦妮、盖玥希、甘露、甘婷婷、甘薇、高洋、龚蓓苾、贡米、关雪盈、关悦、郭柯彤、郭晓婷、郝蕾、何杜鹃、何泓姗、侯梦莎、侯梦瑶、胡可、黄灿灿、黄龄、黄梦莹、黄婷婷、黄雅莉、黄一琳、纪姿含、菅纫姿、蒋方婷、江铠同、姜妍、金巧巧、柯蓝、赖美云、斓曦、蓝盈莹、李艾、李纯、李兰迪、李金铭、李曼、李梦、李萌萌、李梦颖、厉娜、李念、李倩、李艺彤、李依晓、黎一萱、梁洁、林静、林妙可、林鹏、刘美含、刘萌萌、刘敏涛、刘人语、刘思彤、刘庭羽、刘雅瑟、龙梅子、卢杉、陆婷、吕佳容、麦迪娜、毛俊杰、毛林林、毛晓慧、孟佳、孟子义、米露、苗苗、苗圃、莫寒、莫小棋、倪虹洁、牟星、穆婷婷、宁丹琳、牛莉、乔欣、潘辰、潘时七、彭小苒、热依扎、商侃、尚语贤、沈傲君、施予斐、宋妍霏、宋伊人、苏青、孙茜、孙耀琦、谈莉娜、谭卓、汤晶媚、唐一菲、田海蓉、陶昕然、童可可、童蕾、王珂、王乐君、王力可、王琳、王瑞子、王馨漪、王秀竹、王婉中、王洋、王一菲、关悦、王媛可、王智、王紫璇、温心、邬靖靖、吴莫愁、吴优、奚梦瑶、肖燕、肖茵、辛芷蕾、熊黛林、徐冬冬、许龄月、许佳琪、徐梦洁、徐悦、宣璐、Yamy、颜丹晨、杨子姗、姚笛、姚芊羽、姚星彤、叶青、殷桃、尤靖茹、余男、雨婷儿、袁娅维、曾轶可、战菁一、张佳宁、张蓝心、章龄之、张萌、张小斐、张辛苑、张杨果而、张瑶、张语格、张予曦、张紫宁、张子萱、张芷溪、瞿颖、赵今麦、赵奕欢、赵圆瑗、赵粤、赵子琪、郑合惠子、郑罗茜、钟楚曦、种丹妮、周楚楚、周放、周洁琼、周雨彤、朱锐、朱圣祎、祝绪丹、朱珠、白澍、毕雯珺、蔡俊涛、曹骏、常远、陈飞宇、陈昊、陈龙、陈星旭、陈宥维、陈哲远、陈震、迟帅、初俊辰、大左、戴景耀、戴阳天、丁程鑫、丁禹兮、杜江、范丞丞、范世錡、费启鸣、冯建宇、傅程鹏、高广泽、高仁、高昊、高鑫、高梓淇、高至霆、耿乐、谷嘉诚、谷智鑫、管栎、韩承羽、郭俊辰、郭麒麟、郭晓峰、郭子凡、韩承羽、黄觉、黄明昊、胡先煦、霍尊、季晨、季肖冰、简弘亦、江明洋、蒋毅、金世佳、金志文、经超、康磊、孔垂楠、李晨浩、李东学、李光洁、李宏毅、李健、李茂、李炜、李汶翰、李泽锋、林申、林彦俊、凌潇肃、刘畅、刘芮麟、刘帅良、刘学义、刘维、刘奕畅、刘宇宁、刘智扬、陆昱霖、马赫、马雪阳、孟瑞、孟召重、米热、宁桓宇、牛骏峰、裴子添、彭楚粤、彭冠英、彭昱畅、蒲巴甲、戚迹、钱枫、钱泳辰、秦昊、屈楚萧、饶威、沈凌、沈泰、宋威龙、苏醒、孙伯纶、檀健次、谭凯、田重、佟梦实、王博文、王东、汪铎、王雷、王琳凯、王龙华、王彦霖、王雨甜、王自健、王子异、魏千翔、徐正溪、魏巍、魏巡、伍嘉成、吴健、吴建飞、吴俊余、吴樾、夏雨、谢彬彬、谢苗、熊梓淇、徐浩、徐可、焉栩嘉、晏紫东、杨九郎、杨玏、杨旭文、应昊茗、尤长靖、于波、余少群、于晓光、于小彤、于小伟、于湉、于毅、袁成杰、袁文康、扎西顿珠、查杰、张博、张铎、张赫、张峻宁、张鲁一、张铭恩、张思帆、张天阳、张桐、张晓晨、张新成、张逸杰、张雨剑、张远、张云雷、张哲瀚、张倬闻、张子文、赵雷、赵品霖、赵天宇、赵志伟、郑凯、郑业成、周深、邹廷威、周艺轩、周震南、朱刚日尧、朱戬、朱星杰、朱泳腾、朱雨辰、朱元冰、朱正廷、朱梓骁、祖峰、左溢、白百何、陈数、陈钰琪、陈紫函、邓家佳、董璇、高露、高圆圆、古力娜扎、海陆、海清、韩雪、胡冰卿、胡静、黄圣依、黄奕、霍思燕、吉克隽逸、贾玲、贾青、江疏影、蒋梦婕、蒋勤勤、蒋依依、江映蓉、江一燕、焦俊艳、金晨、金莎、景甜、鞠婧祎、阚清子、李菲儿、李沁、李晟、李溪芮、李小冉、李一桐、林允、刘惜君、柳岩、刘芸、娄艺潇、路晨、吕一、马丽、马思纯、马苏、马伊俐、毛晓彤、梅婷、孟美岐、戚薇、秦海璐、秦岚、尚雯婕、沈梦辰、沈月、舒畅、宋轶、宋祖儿、孙骁骁、孙怡、谭松韵、谭维维、唐艺昕、童瑶、万茜、王丽坤、王麟、王珞丹、王鸥、王蓉、王晓晨、王子文、吴谨言、吴倩、吴昕、吴宣仪、邢菲、熊乃瑾、徐娇、徐璐、杨蓉、叶璇、颖儿、郁可唯、袁冰妍、袁泉、赵韩樱子、赵露思、张碧晨、张慧雯、张静初、张俪、张檬、张含韵、张嘉倪、张天爱、张歆艺、张雪迎、张雨绮、张子枫、左小青、艾伦、白敬亭、白举纲、白客、白宇、包贝尔、蔡徐坤、陈若轩、陈翔、陈晓、陈学冬、成毅、大张伟、董成鹏、董子健、窦骁、段奕宏、付辛博、高伟光、高云翔、郭京飞、郭晓东、韩栋、韩东君、韩庚、何晟铭、侯明昊、胡兵、胡海泉、胡彦斌、胡一天、华晨宇、黄景瑜、黄轩、黄宥明、姜潮、金瀚、雷佳音、李佳航、李荣浩、罗云熙、马可、马天宇、毛不易、茅子俊、聂远、欧豪、潘粤明、乔振宇、秦俊杰、任嘉伦、任重、沙溢、盛一伦、释小龙、孙坚、孙艺洲、王传君、王千源、王学兵、王迅、王栎鑫、魏晨、魏大勋、吴磊、肖央、邢昭林、徐海乔、徐开骋、许凯、许魏洲、严屹宽、杨烁、杨志刚、叶祖新、印小天、尹正、俞灏明、于和伟、于朦胧、袁弘、曾舜晞、张彬彬、张嘉益、张晋、张伦硕、张睿、张若昀、张晓龙、张译、张云龙、周一围、朱亚文、Angelababy、迪丽热巴、关晓彤、李冰冰、李宇春、蒋欣、刘诗诗、刘涛、刘亦菲、倪妮、宋佳、宋茜、孙俪、唐嫣、佟丽娅、谢娜、杨超越、杨幂、杨紫、姚晨、袁姗姗、张靓颖、张馨予、章子怡、赵丽颖、赵薇、周冬雨、周迅、陈赫、陈坤、邓超、邓伦、杜淳、冯绍峰、胡歌、黄渤、黄磊、黄晓明、黄子韬、贾乃亮、李晨、李现、李易峰、林更新、鹿晗、靳东、井柏然、刘昊然、刘烨、陆毅、罗晋、沈腾、孙红雷、佟大为、王宝强、汪峰、王俊凯、王凯、王一博、王源、吴京、吴亦凡、小沈阳、肖战、徐峥、杨洋、易烊千玺、岳云鹏、张翰、张杰、张一山、张艺兴、赵文卓、郑恺、朱一龙".split("、");

const lowbi = "爽文、奇葩、无语、入坑、震碎、假如、有哪个瞬间、玄幻、网文、丧尸、主演、救赎、情劫、小说、政治、社死、贴吧、平行世界、笑到、你身边、讲一个、封神、短句、体验、故事、你见过、哪些句子、吃货、笑话、开头、细思极恐、可不可以、一个月、为开头、打脸、有没有、哪句话、最能打动、很喜欢、一句话、如果、假如有、有哪些、细思极恐".split("、");

const area = "东北、长三角、珠三角".split("、");

const foolWriter = "我不是药、情满四合院、西部世界、小品、流浪的蛤蟆、辰东、知否、无间道、作家、港片、电影、斗破苍穹、清宫、电视剧、杨乃武、梦华录、刘慈欣、水浒传、宋江、戴宗、李逵、西游记、三国、哈利波特、Potter、人民日报、张爱玲、柴静、冰心、林徽因、红楼梦、宝玉、黛玉、宝钗、梁思成、莫言".split("、");

const foolGame = "评价游戏、电子游戏、DOTA、电竞、狼人杀、数码宝贝、游戏质量、SOUL、剧本、剑圣、steam、wegame、武磊、明日方舟、武术、崩坏、孙杨、羽毛球、足球、篮球、乒乓、王者、海贼王、李逍遥、动画、动漫、原神、米哈游、我的世界、英雄联盟、lol、LOL、LPL、三国杀、辉夜、喜羊羊、天气之子、乙女、NBA、CBA、cba、cuba、乔丹、杜兰特、詹姆斯、科比、库里".split("、");

const foolHots = "马航、张召忠、胡锡进、塔利班、安倍、银行、张角、佩罗西、陈平、观察者、司马南、孙笑川、孙小果、传销、1450、希特勒、网红、张维为、乌合麒麟、俄乌、俄军、乌军、乌克兰、俄罗斯、来电了、夏日祭、飞盘、周公子、周劼、徐雷、东航、二舅、蒋介石、中金".split("、");

const foolRelations = ["心动", "一瞬间", "暗恋", "深情", "原生家庭", "尴尬", "告白", "丈母娘", "脱单", "孕妇", "备孕", "爱情", "前任", "剩女", "剩男", "相亲", "明星", "绿茶", "什么感觉", "被爱", "彩礼", "婚姻", "颜值", "情书", "早恋", "少年感", "老婆", "老公", "男孩", "女孩", "情侣", "男人", "男票", "独生女", "童话", "婚后", "老公", "小三", "暧昧", "男主", "女主", "青梅竹马", "天降", "校花", "姻缘", "纯友谊", "男女", "分手", "很虐", "古言", "七夕", "女儿", "女友", "女性", "女人", "虐文", "夫妻", "微信", "恋爱", "男友", "第六感", "情话", "朋友圈", "最最最", "温柔", "女孩子", "表白", "异地恋", "治愈", "暖心", "追妻", "忘记", "虐心", "病娇", "男朋友", "女朋友", "男生", "女生", "渣男", "渣女", "容易喜欢", "嫁妆", "出轨", "怀孕", "结婚", "离婚"];

const foolCompany = ["恒大", "格力", "董明珠", "短视频", "小红书", "抖音", "乐视", "贾跃亭", "荣耀", "检察日报", "芯片", "华为", "鸿蒙", "比亚迪", "特斯拉", "白象", "中医", "蔚来", "任正非", "余承东", "马斯克", "360"];

const foolPrefix = "王垠、爱狗、遛狗、外卖、副业、身边、全班、小学、高中、高考、大专、说唱、复读、高一、高二、高三、中学、大学、预言、学霸、学渣、热评、白月光、女配、有什么、树洞、放弃、理财、兼职、甜".split("、");

const keywords = ["台独", "意味着", "公务员", "民主党", "释放了什么信号", "美军", "大陆", "航母", "军训", "教官", "军演", "警察", "信号", "耐克", "军费", "阿迪", "上将", "中将", "少将", "战役", "永动机", "彩票", "保安", "部队", "台积电", "越南", "县城", "小城市", "静默", "立陶宛", "台军", "公知", "化妆", "公安", "溥仪", "疫情", "爱" + speFont, speFont + "籍", "海军", "空军", "陆军", "台海", "中" + speFont, speFont + "防部", "战区", "三鹿", "EXCEL", "excel"]
	.concat(provinces, cityNames, foolsNames, lowbi, area, foolWriter, foolGame, foolHots)
	.concat(foolRelations, foolCompany, foolPrefix);


function injectCustomJs(/* jsPath */) {
	// jsPath = jsPath || 'js/inject.js';
	var temp = document.createElement('script');
	temp.innerHTML = `const b='${ keywords.join(",,,") }'.split(",,,"),a=(console.error(b),window.fetch);function c(e){const d=new Set;return e.data=e.data.filter(p=>p.target&&!p.brief.includes("zvideo")&&!p.brief.includes("article")&&!p.brief.includes("advert")&&(!p.target.attachment||2!==p.target.attachment.type)&&p.target.author&&!d.has(p.target.id)&&d.add(p.target.id)),console.error("filterData1：",e.data),e.data=e.data.filter(q=>b.every(keyword=>!q.target.question.title.includes(keyword))),console.error("filterData：",e.data),e}window.fetch=function(...arg){const f=a.apply(this,arg);if(!/recommend/.test(arg[0]))return f;const g=Array.from({length:15}).map(()=>a.apply(this,arg).then(res=>res.json()));return f.then(res=>{const h=Response.prototype.json;return res.json=function(){var i=h.call(res);return Promise.all(g.concat(i)).then(function(j){return j.slice(0,-1).reduce((k,m)=>(k.data=k.data.concat(m.data),k),j[j.length-1])}).then(c)},res})};`
	// console.error('extension6');
	document.head.appendChild(temp);
}


